package com.mjl.util;

import com.mjl.model.ContentsDTO;

import java.util.ArrayList;
import java.util.List;

/**
 * @author mjl
 * @date 2025/9/22.
 * 把目录层级选到最细 考出来
 * wps新增智能文档，贴到里面，导出为docx，再复制到其他的里面目录就对了
 */
public class ContentsUtil {
    public static void main(String[] args) {
        String s =
                "3.1.2. 生产运营管理系统\t4\n" +
                        "3.1.2.1. 视频监控管理\t4\n" +
                        "3.1.2.1.1. 视频轮询\t4\n" +
                        "3.1.2.1.2. 录像回放\t6\n" +
                        "3.1.2.1.3. 实时视频\t7\n" +
                        "3.1.2.1.4. 视频配置\t9\n" +
                        "3.1.2.1.4.1. 视频设备\t9\n" +
                        "3.1.2.1.4.2. 视频分组\t12\n" +
                        "3.1.2.1.4.3. 自动轮播配置\t13\n" +
                        "3.1.2.2. 基础信息管理\t13\n" +
                        "3.1.2.3. 水厂生产管理综合看板\t15\n" +
                        "3.1.2.4. 水厂监测预警管理\t16\n" +
                        "3.1.2.4.1. 实时监测数据\t16\n" +
                        "3.1.2.4.2. 历史数据分析\t17\n" +
                        "3.1.2.4.3. 报警管理\t17\n" +
                        "3.1.2.4.3.1. 报警记录\t17\n" +
                        "3.1.2.4.3.2. 报警规则配置\t18\n" +
                        "3.1.2.4.3.3. 监测量管理\t20\n" +
                        "3.1.2.4.3.4. 监测配置\t24\n" +
                        "3.1.2.4.3.5. 设备报警配置\t25\n" +
                        "3.1.2.5. 统计分析\t26\n" +
                        "3.1.2.6. 运营报表\t27\n" +
                        "3.1.2.6.1. 水质运营报表\t27\n" +
                        "3.1.2.6.2. 水量运营报表\t28\n" +
                        "3.1.2.6.3. 压力运行报表\t29\n" +
                        "3.1.2.7. 设备管理\t29\n" +
                        "3.1.2.7.1. 设备台账\t29\n" +
                        "3.1.2.7.2. 监测点有效绑定\t35\n" +
                        "3.1.2.7.3. 设备基础配置\t35\n" +
                        "3.1.2.7.4. 设备分组标签\t37\n" +
                        "3.1.3. 管网地理信息管理系统\t37\n" +
                        "3.1.3.1. 供水GIS一张图\t37\n" +
                        "3.1.3.2. 供水管网监测预警\t40\n" +
                        "3.1.3.2.1. 实时监测\t40\n" +
                        "3.1.3.2.2. 历史数据分析\t40\n" +
                        "3.1.3.2.3. 在线监测\t40\n" +
                        "3.1.3.2.4. 告警管理\t42\n" +
                        "3.1.3.2.4.1. 报警记录\t42\n" +
                        "3.1.3.2.4.2. 报警规则配置\t43\n" +
                        "3.1.3.2.4.3. 监测量管理\t46\n" +
                        "3.1.3.2.4.4. 监测配置\t49\n" +
                        "3.1.3.2.4.5. 报警联系人配置\t50\n" +
                        "3.1.3.3. 管网基础数据管理\t52\n" +
                        "3.1.3.3.1. 监测管点\t52\n" +
                        "3.1.3.3.2. 供水管线\t53\n" +
                        "3.1.3.3.3. 供水管点\t54\n" +
                        "3.1.3.3.4. 供水泵站\t56\n" +
                        "3.1.3.3.5. 基础设施类型配置\t57\n" +
                        "3.1.3.3.6. 水司水厂管理\t61\n" +
                        "3.1.3.3.7. 历史数据备份\t61\n" +
                        "3.1.3.3.7.1. 管线版本记录\t61\n" +
                        "3.1.3.4. 基础设施\t62\n" +
                        "3.1.3.4.1. 水务公司\t62\n" +
                        "3.1.3.4.2. 消防栓\t64\n" +
                        "3.1.4. 巡检养护管理系统\t65\n" +
                        "3.1.4.1. 巡检养护任务统计分析管理\t65\n" +
                        "3.1.4.1.1. 巡检人员定位管理\t65\n" +
                        "3.1.4.1.2. 巡检人员统计\t66\n" +
                        "3.1.4.1.3. 巡检养护工作台\t67\n" +
                        "3.1.4.2. 巡检养护任务记录管理\t68\n" +
                        "3.1.4.2.1. 巡检任务管理\t68\n" +
                        "3.1.4.2.1.1. 巡查计划\t68\n" +
                        "3.1.4.2.1.2. 巡查任务\t70\n" +
                        "3.1.4.2.1.3. 巡检记录\t73\n" +
                        "3.1.4.2.2. 养护任务管理\t74\n" +
                        "3.1.4.2.2.1. 养护计划\t74\n" +
                        "3.1.4.2.2.2. 养护任务\t76\n" +
                        "3.1.4.2.2.3. 养护记录\t82\n" +
                        "3.1.4.3. 巡检养护配置\t82\n" +
                        "3.1.4.3.1. 巡检项配置\t82\n" +
                        "3.1.4.3.2. 对象类型管理\t85\n" +
                        "3.1.4.3.3. 故障类型配置\t88\n" +
                        "3.1.4.3.4. 对象管理\t88\n" +
                        "3.1.4.3.5. 对象表单管理\t89\n" +
                        "3.1.4.3.6. 巡检区域配置管理\t90\n" +
                        "3.1.4.3.6.1. 区域类型管理\t90\n" +
                        "3.1.4.3.6.2. 区域管理\t90\n" +
                        "3.1.4.3.6.3. 区域地图管理\t90\n" +
                        "3.1.4.3.7. 对象集管理\t91\n" +
                        "3.1.4.3.8. 业务类型管理\t93\n" +
                        "3.1.4.3.9. 系统配置\t93\n" +
                        "3.1.5. 智慧漏损管理系统\t94\n" +
                        "3.1.5.1. 漏损综合看板\t94\n" +
                        "3.1.5.1.1. 分区总览\t94\n" +
                        "3.1.5.1.2. 分区详情\t95\n" +
                        "3.1.5.2. 表具管理\t96\n" +
                        "3.1.5.2.1. 流量计\t96\n" +
                        "3.1.5.2.2. 压力计\t96\n" +
                        "3.1.5.3. 压力监测分析\t97\n" +
                        "3.1.5.3.1. 压力报表\t97\n" +
                        "3.1.5.4. 流量监测\t98\n" +
                        "3.1.5.4.1. 实时监测数据\t98\n" +
                        "3.1.5.4.2. 历史数据分析\t98\n" +
                        "3.1.5.4.3. 在线监测\t99\n" +
                        "3.1.5.4.4. 瞬时流量分析\t99\n" +
                        "3.1.5.5. 漏损报警\t100\n" +
                        "3.1.5.5.1. 漏损报警\t100\n" +
                        "3.1.5.5.2. 漏损报警（对接）\t102\n" +
                        "3.1.5.6. 各水厂用水分析\t104\n" +
                        "3.1.5.7. 产销差报表\t105\n" +
                        "3.1.5.7.1. 产销差分析\t105\n" +
                        "3.1.5.8. 流量报表\t107\n" +
                        "3.1.5.9. 分区配置\t108\n" +
                        "3.1.5.9.1. 分区设置\t108\n" +
                        "3.1.5.9.2. 片区台账\t109\n" +
                        "3.1.5.10. 配置管理\t112\n" +
                        "3.1.5.10.1. 时段配置\t112\n" +
                        "3.1.6. 工单处置全流程管理系统\t114\n" +
                        "3.1.6.1. 工单处置记录管理\t114\n" +
                        "3.1.6.1.1. 待办工单\t114\n" +
                        "3.1.6.1.2. 历史工单\t117\n" +
                        "3.1.6.1.3. 工单督办\t118\n" +
                        "3.1.6.2. 工单处置统计分析\t119\n" +
                        "3.1.6.3. 基础配置\t120\n" +
                        "3.1.6.3.1. 系统配置\t120\n" +
                        "3.1.6.3.2. 业务配置\t121\n" +
                        "3.1.6.3.3. 来源配置\t121\n" +
                        "3.1.6.3.4. 工单类别\t122\n" +
                        "3.1.6.3.5. 紧急程度配置\t122\n" +
                        "3.1.7. 供水调度管理系统\t123\n" +
                        "3.1.7.1. 调度总览\t123\n" +
                        "3.1.7.1.1. 调度总览一张图\t123\n" +
                        "3.1.7.1.2. 水厂调度监控\t129\n" +
                        "3.1.7.2. 调度指令\t131\n" +
                        "3.1.7.3. 分析决策\t135\n" +
                        "3.1.7.3.1. 泵机运行监测\t135\n" +
                        "3.1.7.3.2. 泵机能耗分析\t136\n" +
                        "3.1.7.3.3. 合格率分析\t139\n" +
                        "3.1.7.3.4. 控制点分析\t139\n" +
                        "3.1.7.4. 综合查询\t142\n" +
                        "3.1.7.4.1. 压力报表\t142\n" +
                        "3.1.7.4.2. 流量报表\t142\n" +
                        "3.1.7.4.3. 水质报表\t143\n" +
                        "3.1.7.4.4. 生产报表\t143\n" +
                        "3.1.7.5. 科学调度\t144\n" +
                        "3.1.7.5.1. 人工调度预案\t144\n" +
                        "3.1.7.5.2. 自控调度预案\t147\n" +
                        "3.1.7.5.3. 调度结果分析\t149\n" +
                        "3.1.7.5.4. 调度日志\t150\n" +
                        "3.1.7.6. 厂站工艺\t151\n" +
                        "3.1.7.7. 报警预警\t153\n" +
                        "3.1.7.8. 远程监测\t154\n" +
                        "3.1.7.8.1. 综合监控画面\t154\n" +
                        "3.1.7.8.2. 视频回放\t156\n" +
                        "3.1.7.8.3. 视频配置\t157\n" +
                        "3.1.7.8.3.1. 视频设备\t157\n" +
                        "3.1.7.8.3.2. 视频分组\t160\n" +
                        "3.1.7.8.3.3. 自动轮播配置\t161\n" +
                        "3.1.7.9. 值班管理\t161\n" +
                        "3.1.7.9.1. 值班方案\t161\n" +
                        "3.1.7.9.1.1. 排班类型\t162\n" +
                        "3.1.7.9.1.2. 班组排班班次\t164\n" +
                        "3.1.7.9.2. 排班管理\t166\n" +
                        "3.1.7.9.2.1. 班组水厂排班服务\t166\n" +
                        "3.1.7.9.2.2. 班组水厂排班记录\t168\n" +
                        "3.1.7.9.2.3. 班组交接班巡查配置\t169\n" +
                        "3.1.7.9.3. 值班记录\t173\n" +
                        "3.1.7.9.4. 值班日志\t174\n" +
                        "3.1.7.9.5. 数据填报\t176\n" +
                        "3.1.7.9.5.1. 模版管理\t176\n" +
                        "3.1.7.9.5.2. 报表配置\t178\n" +
                        "3.1.7.9.5.3. 报表填报与审核\t180\n" +
                        "3.1.7.9.6. 超限记录\t182\n" +
                        "3.1.8. 水力模型系统\t184\n" +
                        "3.1.8.1. 实时监控\t184\n" +
                        "3.1.8.1.1. 在线监测\t184\n" +
                        "3.1.8.1.2. 工况模拟\t187\n" +
                        "3.1.8.2. 水量预测\t189\n" +
                        "3.1.8.3. 事件处置\t191\n" +
                        "3.1.8.4. 水质分析\t193\n" +
                        "3.1.8.5. 拓扑配置\t194\n" +
                        "3.1.8.6. 泵组优化\t195\n" +
                        "3.1.8.6.1. 水泵效率分析\t195\n" +
                        "3.1.8.6.2. 水泵运行预测\t197\n" +
                        "3.1.8.6.3. 水泵信息及特性曲线配置\t198\n" +
                        "3.1.8.7. 报表统计\t199\n" +
                        "3.1.8.7.1. 压力统计表\t199\n" +
                        "3.1.8.7.1.1. 供水厂压力统计表\t199\n" +
                        "3.1.8.7.1.2. 管网压力统计表\t200\n" +
                        "3.1.8.7.2. 流速流量统计表\t200\n" +
                        "3.1.8.7.2.1. 供水厂流量流速统计表\t200\n" +
                        "3.1.8.7.2.2. 管网流量流速统计表\t201\n" +
                        "3.1.9. 综合决策管理平台\t201\n" +
                        "3.1.9.1. 综合管理\t201\n" +
                        "3.1.9.2. 供水厂专题分析\t204\n" +
                        "3.1.9.3. 水务管网专题分析\t208\n" +
                        "3.1.9.4. 物联网专题分析\t212\n" +
                        "3.1.9.5. 工单管理专题分析\t213\n" +
                        "3.1.9.6. 巡检养护专题分析\t216\n" +
                        "3.1.10. 数据中心\t220\n" +
                        "3.1.10.1. 元数据管理\t220\n" +
                        "3.1.10.1.1. 数据源管理\t220\n" +
                        "3.1.10.1.2. 分类树管理\t220\n" +
                        "3.1.10.1.3. 表管理\t221\n" +
                        "3.1.10.2. 数据库管理\t222\n" +
                        "3.1.10.2.1. 元数据库建设\t222\n" +
                        "3.1.10.2.2. 基础数据库建设\t223\n" +
                        "3.1.10.2.3. 业务要素库梳理\t223\n" +
                        "3.1.10.2.4. 业务数据建设\t224\n" +
                        "3.1.10.2.5. 系统数据库建设\t225\n" +
                        "3.1.10.3. 数据集成\t226\n" +
                        "3.1.10.3.1. 数据质量管理\t226\n" +
                        "3.1.10.3.2. 数据共享管理\t227\n" +
                        "3.1.11. 基础软件支持平台\t228\n" +
                        "3.1.11.1. 物联网平台\t228\n" +
                        "3.1.11.1.1. 设备接入\t228\n" +
                        "3.1.11.1.1.1. 设备台账\t228\n" +
                        "3.1.11.1.1.2. 设备基础配置\t233\n" +
                        "3.1.11.1.1.3. 设备分组标签\t235\n" +
                        "3.1.11.1.2. 数据解析\t235\n" +
                        "3.1.11.1.2.1. 设备连接\t235\n" +
                        "3.1.11.1.2.2. 数据采集\t240\n" +
                        "3.1.11.1.2.3. 数据分析\t243\n" +
                        "3.1.11.1.3. 状态监控\t245\n" +
                        "3.1.11.1.4. 告警管理\t249\n" +
                        "3.1.11.1.4.1. 告警记录\t249\n" +
                        "3.1.11.1.4.2. 告警规则配置\t249\n" +
                        "3.1.11.1.4.3. 告警联系人配置\t251\n" +
                        "3.1.11.1.4.4. 设备报警配置\t253\n" +
                        "3.1.11.2. 视频监控平台\t254\n" +
                        "3.1.11.2.1. 视频接入管理\t254\n" +
                        "3.1.11.2.1.1. 视频同步\t254\n" +
                        "3.1.11.2.1.2. 视频设备\t254\n" +
                        "3.1.11.2.1.3. 视频分组\t257\n" +
                        "3.1.11.2.2. 视频浏览管理\t258\n" +
                        "3.1.11.2.3. 视频录像\t259\n" +
                        "3.1.11.2.4. 轮巡管理\t261\n" +
                        "3.1.11.3. 消息引擎管理平台\t262\n" +
                        "3.1.11.3.1. 消息类型定义与模板\t262\n" +
                        "3.1.11.3.2. 消息发送与接收\t265\n" +
                        "3.1.11.3.3. 消息安全与隐私保护\t266\n" +
                        "3.1.11.4. 展示管理基础平台\t269\n" +
                        "3.1.11.4.1. 数据源管理\t269\n" +
                        "3.1.11.4.2. 数据集管理\t269\n" +
                        "3.1.11.4.2.1. 数据分组\t269\n" +
                        "3.1.11.4.2.2. 数据集\t270\n" +
                        "3.1.11.4.3. 页面设计管理\t271\n" +
                        "3.1.11.4.4. 放映管理\t274\n" +
                        "3.1.11.5. 统一工作流引擎\t275\n" +
                        "3.1.11.5.1. 流程库与设计器\t275\n" +
                        "3.1.11.5.2. 流程控制台\t277\n" +
                        "3.1.12. 水厂智能加药系统\t279\n" +
                        "3.1.12.1. 水厂智能加药系统\t279\n" +
                        "3.1.12.1.1. 水质监测\t279\n" +
                        "3.1.12.1.2. 智能加药控制\t280\n" +
                        "3.1.12.1.2.1. 加药预测\t280\n" +
                        "3.1.12.1.2.2. 智能加药配置\t281\n" +
                        "3.1.12.1.3. 报警提醒及处理\t286\n" +
                        "3.1.12.1.4. 药耗管理\t286\n" +
                        "3.1.12.1.5. 系统管理\t287\n" +
                        "3.1.12.1.5.1. 加药配置\t287\n" +
                        "3.1.12.1.5.1.1. 点位类型配置\t287\n" +
                        "3.1.12.1.5.1.2. 模型配置\t287\n" +
                        "3.1.12.1.5.1.3. 组态管理\t289\n" +
                        "3.1.12.1.5.1.4. 任务执行\t290\n" +
                        "3.1.12.1.5.1.5. 加药结果\t291\n" +
                        "3.1.13. 可视化BI平台\t292\n" +
                        "3.1.14. 后台管理\t294\n" +
                        "3.1.14.1. 第三方\t294\n" +
                        "3.1.14.1.1. 第三方消息记录\t294\n" +
                        "3.1.14.1.2. 第三方平台\t296\n" +
                        "3.1.14.1.3. 第三方消息类型\t298\n" +
                        "3.1.14.2. 配置\t300\n" +
                        "3.1.14.2.1. 弹窗配置\t300\n" +
                        "3.1.14.2.2. GIS一张图配置\t301\n" +
                        "3.1.14.2.3. 组态图配置\t303\n" +
                        "3.1.14.2.4. 图层配置\t304\n" +
                        "3.1.14.2.5. 片区配置\t306\n" +
                        "3.1.14.2.6. 系统配置\t307\n" +
                        "3.1.14.2.7. 合理范围配置\t307\n" +
                        "3.1.14.3. 后台管理\t308\n" +
                        "3.1.14.3.1. 行政区划管理\t308\n" +
                        "3.1.14.3.2. 组织机构管理\t311\n" +
                        "3.1.14.3.3. 参数配置\t313\n" +
                        "3.1.14.3.4. 租户角色管理\t314\n" +
                        "3.1.14.3.5. 人员管理\t314\n" +
                        "3.1.14.3.6. 区域类型管理\t321\n" +
                        "3.1.14.3.7. 区域管理\t321\n" +
                        "3.1.14.3.8. 区域地图管理\t321\n" +
                        "3.1.14.4. 统计\t322\n" +
                        "3.1.14.4.1. 登录日志\t322\n" +
                        "3.1.14.4.2. 平台登录统计\t323\n";

//        String[] split = s.replaceAll("\\d", "").replaceAll("\\.", "#").replaceAll("\t","").split("\n");
        String[] split = s.split("\n");
        List<String> list = List.of(split);
        List<ContentsDTO> contentsDTOS = new ArrayList<>();

        for (String string : list) {
            String[] split1 = string.split("\t")[0].split(" ");
            ContentsDTO dto = new ContentsDTO();
            String s1 = split1[0];
            dto.setTitle(split1[0].substring(0, s1.length() - 1));
            dto.setName(split1[1]);
            contentsDTOS.add(dto);
        }

        System.out.println();
    }

    public static int countHashtags(String str) {
        // 处理null情况
        if (str == null) {
            return 0;
        }

        int count = 0;
        // 遍历字符串中的每个字符
        for (int i = 0; i < str.length(); i++) {
            // 检查当前字符是否为#
            if (str.charAt(i) == '#') {
                count++;
            }
        }
        return count;
    }
}
